Revit 2027 API
FormulaEditingEventArgs.ParameterId Property
 Returns the Id of the modified parameter
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ParameterId { get; }
Public ReadOnly Property ParameterId As ElementId
	Get
public:
property ElementId^ ParameterId {
	ElementId^ get ();
}
member ParameterId : ElementId with get
Property Value
ElementId
See Also
Reference
FormulaEditingEventArgs Class
Autodesk.Revit.UI.Events Namespace